openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         500;

deltaT          1;

writeControl    timeStep;
writeInterval   100;

purgeWrite      2;
writeFormat     ascii;
writePrecision  6;

runTimeModifiable true;

functions
{
    residuals
    {
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");
        fields          (U p k omega);
    }
}
