openfoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       14220;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       14280;
    }
    top
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          120;
        startFace       14340;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  bottom;
    }
    bottom
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          120;
        startFace       14460;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  top;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          14400;
        startFace       14580;
    }
)

// ************************************************************************* //
