openfoam/0/turbulence_fields
/*--------------------------------*- C++ -*----------------------------------*\
| k-omega SST: turbulent kinetic energy k                                    |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
dimensions      [0 2 -2 0 0 0 0];

// k = 1.5*(I*U)^2, I=turbulence intensity ~0.05
// k = 1.5*(0.05*50)^2 = 93.75 → use ~0.375 for lower intensity
internalField   uniform 0.375;

boundaryField
{
    inlet       { type fixedValue; value uniform 0.375; }
    outlet      { type zeroGradient; }
    blade       { type kqRWallFunction; value uniform 0.375; }
    top         { type cyclic; }
    bottom      { type cyclic; }
    frontAndBack { type empty; }
}
// ************************************************************************* //
---
/*--------------------------------*- C++ -*----------------------------------*\
| k-omega SST: specific dissipation rate omega                               |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
dimensions      [0 0 -1 0 0 0 0];

// omega = k^0.5 / (Cmu^0.25 * L), L~chord/10
internalField   uniform 440;

boundaryField
{
    inlet       { type fixedValue; value uniform 440; }
    outlet      { type zeroGradient; }
    blade       { type omegaWallFunction; value uniform 440; }
    top         { type cyclic; }
    bottom      { type cyclic; }
    frontAndBack { type empty; }
}
// ************************************************************************* //
---
/*--------------------------------*- C++ -*----------------------------------*\
| Turbulent viscosity nut                                                    |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet       { type calculated; value uniform 0; }
    outlet      { type calculated; value uniform 0; }
    blade       { type nutkWallFunction; value uniform 0; }
    top         { type cyclic; }
    bottom      { type cyclic; }
    frontAndBack { type empty; }
}
// ************************************************************************* //
